test_like_a_hero/app/controllers/enemies_controller.rb

  def set_enemy
    @enemy = Enemy.find(params[:id])
---
SELECT  "enemies".* FROM "enemies" WHERE "enemies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]